"""
Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.
Пример:
список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
список: [], ищем: "123", ответ: -1
"""


def find_pos(el, spis):
    count = 0
    for i in range(len(spis)):
        if el == spis[i]:
            count += 1
            if count == 2:
                return i + 1
    return -1


user_list = ["qwe", "asd", "zxc", "qwe", "ertqwe", "йцу", "фыв", "ячс", "цук", "йцукен", "йцу", "йцу", "фыв", "ячс",
             "цук", "йцукен", "123", "234", 123, "567", "asd"]

slovo = input('Что ищем?: ')
print(f'Ищем: {slovo}, ответ: ', find_pos(slovo, user_list))
